portapack-mayhem/mayhem-firmware/firmware/chibios/os/hal/platforms/LPC13xx/LPC13xx.h
/****************************************************************************
 *   $Id:: LPC13xx.h 7402 2011-05-25 18:48:12Z usb00175                     $
 *   Project: NXP LPC13xx software example
 *
 *   Description:
 *     CMSIS Cortex-M0 Core Peripheral Access Layer Header File for
 *     NXP LPC13xx Device Series
 *
 ****************************************************************************
 * Software that is described herein is for illustrative purposes only
 * which provides customers with programming information regarding the
 * products. This software is supplied "AS IS" without any warranties.
 * NXP Semiconductors assumes no responsibility or liability for the
 * use of the software, conveys no license or title under any patent,
 * copyright, or mask work right to the product. NXP Semiconductors
 * reserves the right to make changes in the software without
 * notification. NXP Semiconductors also make no representation or
 * warranty that such application will be suitable for the specified
 * use without further testing or modification.
 ****************************************************************************/

#ifndef __LPC13xx_H__
#define __LPC13xx_H__

#ifdef __cplusplus
extern "C" {
#endif

/** @addtogroup LPC13xx_Definitions LPC13xx Definitions
	This file defines all structures and symbols for LPC13xx:
		- Registers and bitfields
		- peripheral base address
		- peripheral ID
		- PIO definitions
	@{
*/

/******************************************************************************/
/*                Processor and Core Peripherals                              */
/******************************************************************************/
/** @addtogroup LPC13xx_CMSIS LPC13xx CMSIS Definitions
	Configuration of the Cortex-M3 Processor and Core Peripherals
	@{
*/

/*
 * ==========================================================================
 * ---------- Interrupt Number Definition -----------------------------------
 * ==========================================================================
 */
typedef enum IRQn {
	/******  Cortex-M3 Processor Exceptions Numbers
		 ***************************************************/
	NonMaskableInt_IRQn = -14,	 /*!< 2 Non Maskable Interrupt	 */
	MemoryManagement_IRQn = -12, /*!< 4 Cortex-M3 Memory Management Interrupt */
	BusFault_IRQn = -11, /*!< 5 Cortex-M3 Bus Fault Interrupt                  */
	UsageFault_IRQn = -10, /*!< 6 Cortex-M3 Usage Fault Interrupt */
	SVCall_IRQn = -5, /*!< 11 Cortex-M3 SV Call Interrupt                   */
	DebugMonitor_IRQn = -4, /*!< 12 Cortex-M3 Debug Monitor Interrupt */
	PendSV_IRQn = -2,	 /*!< 14 Cortex-M3 Pend SV Interrupt                   */
	SysTick_IRQn = -1, /*!< 15 Cortex-M3 System Tick Interrupt               */

	/******  LPC13xx Specific Interrupt Numbers
		 *******************************************************/
	WAKEUP0_IRQn = 0, /*!< All I/O pins can be used as wakeup source.       */
	WAKEUP1_IRQn = 1, /*!< There are 40 pins in total for LPC17xx           */
	WAKEUP2_IRQn = 2,
	WAKEUP3_IRQn = 3,
	WAKEUP4_IRQn = 4,
	WAKEUP5_IRQn = 5,
	WAKEUP6_IRQn = 6,
	WAKEUP7_IRQn = 7,
	WAKEUP8_IRQn = 8,
	WAKEUP9_IRQn = 9,
	WAKEUP10_IRQn = 10,
	WAKEUP11_IRQn = 11,
	WAKEUP12_IRQn = 12,
	WAKEUP13_IRQn = 13,
	WAKEUP14_IRQn = 14,
	WAKEUP15_IRQn = 15,
	WAKEUP16_IRQn = 16,
	WAKEUP17_IRQn = 17,
	WAKEUP18_IRQn = 18,
	WAKEUP19_IRQn = 19,
	WAKEUP20_IRQn = 20,
	WAKEUP21_IRQn = 21,
	WAKEUP22_IRQn = 22,
	WAKEUP23_IRQn = 23,
	WAKEUP24_IRQn = 24,
	WAKEUP25_IRQn = 25,
	WAKEUP26_IRQn = 26,
	WAKEUP27_IRQn = 27,
	WAKEUP28_IRQn = 28,
	WAKEUP29_IRQn = 29,
	WAKEUP30_IRQn = 30,
	WAKEUP31_IRQn = 31,
	WAKEUP32_IRQn = 32,
	WAKEUP33_IRQn = 33,
	WAKEUP34_IRQn = 34,
	WAKEUP35_IRQn = 35,
	WAKEUP36_IRQn = 36,
	WAKEUP37_IRQn = 37,
	WAKEUP38_IRQn = 38,
	WAKEUP39_IRQn = 39,
	I2C_IRQn = 40,				/*!< I2C Interrupt                                    */
	TIMER_16_0_IRQn = 41, /*!< 16-bit Timer0 Interrupt                          */
	TIMER_16_1_IRQn = 42, /*!< 16-bit Timer1 Interrupt                          */
	TIMER_32_0_IRQn = 43, /*!< 32-bit Timer0 Interrupt                          */
	TIMER_32_1_IRQn = 44, /*!< 32-bit Timer1 Interrupt                          */
	SSP0_IRQn = 45,				/*!< SSP Interrupt                                    */
	UART_IRQn = 46,				/*!< UART Interrupt                                   */
	USB_IRQn = 47,				/*!< USB Regular Interrupt                            */
	USB_FIQn = 48,				/*!< USB Fast Interrupt                               */
	ADC_IRQn = 49,				/*!< A/D Converter Interrupt                          */
	WDT_IRQn = 50,				/*!< Watchdog timer Interrupt                         */
	BOD_IRQn = 51,				/*!< Brown Out Detect(BOD) Interrupt                  */
	EINT3_IRQn = 53,			/*!< External Interrupt 3 Interrupt                   */
	EINT2_IRQn = 54,			/*!< External Interrupt 2 Interrupt                   */
	EINT1_IRQn = 55,			/*!< External Interrupt 1 Interrupt                   */
	EINT0_IRQn = 56,			/*!< External Interrupt 0 Interrupt                   */
	SSP1_IRQn = 57,				/*!< SSP1 Interrupt                                   */
} IRQn_Type;

/*
 * ==========================================================================
 * ----------- Processor and Core Peripheral Section ------------------------
 * ==========================================================================
 */

/* Configuration of the Cortex-M3 Processor and Core Peripherals */
#define __MPU_PRESENT 1 /*!< MPU present or not */
#define __NVIC_PRIO_BITS \
	3 /*!< Number of Bits used for Priority Levels          */
#define __Vendor_SysTickConfig \
	0 /*!< Set to 1 if different SysTick Config is used     */

/*@}*/ /* end of group LPC13xx_CMSIS */

#include "core_cm3.h" /* Cortex-M3 processor and core peripherals           */
#include "system_LPC13xx.h" /* System Header                                      */

/******************************************************************************/
/*                Device Specific Peripheral Registers structures             */
/******************************************************************************/

#if defined(__CC_ARM)
#pragma anon_unions
#endif

/*------------- System Control (SYSCON) --------------------------------------*/
/** @addtogroup LPC13xx_SYSCON LPC13xx System Control Block
	@{
*/
typedef struct {
	__IO uint32_t
			SYSMEMREMAP; /*!< Offset: 0x000 (R/W)  System memory remap Register */
	__IO uint32_t
			PRESETCTRL; /*!< Offset: 0x004 (R/W)  Peripheral reset control Register */
	__IO uint32_t
			SYSPLLCTRL; /*!< Offset: 0x008 (R/W)  System PLL control Register */
	__I uint32_t
			SYSPLLSTAT; /*!< Offset: 0x00C (R/ )  System PLL status Register */
	__IO uint32_t USBPLLCTRL; /* USB PLL control, offset 0x10 */
	__IO uint32_t USBPLLSTAT;
	uint32_t RESERVED0[2];

	__IO uint32_t SYSOSCCTRL; /*!< Offset: 0x020 (R/W)  System oscillator control
															 Register */
	__IO uint32_t WDTOSCCTRL; /*!< Offset: 0x024 (R/W)  Watchdog oscillator
															 control Register */
	__IO uint32_t IRCCTRL;		/*!< Offset: 0x028 (R/W)  IRC control Register */
	uint32_t RESERVED1[1];
	__IO uint32_t
			SYSRSTSTAT; /*!< Offset: 0x030 (R/W)  System reset status Register */
	uint32_t RESERVED2[3];
	__IO uint32_t SYSPLLCLKSEL; /*!< Offset: 0x040 (R/W)  System PLL clock source
																 select Register */
	__IO uint32_t SYSPLLCLKUEN; /*!< Offset: 0x044 (R/W)  System PLL clock source
																 update enable Register */
	__IO uint32_t USBPLLCLKSEL;
	__IO uint32_t USBPLLCLKUEN;
	uint32_t RESERVED3[8];

	__IO uint32_t
			MAINCLKSEL; /*!< Offset: 0x070 (R/W)  Main clock source select Register */
	__IO uint32_t MAINCLKUEN;		/*!< Offset: 0x074 (R/W)  Main clock source update
																 enable Register */
	__IO uint32_t SYSAHBCLKDIV; /*!< Offset: 0x078 (R/W)  System AHB clock divider
																 Register */
	uint32_t RESERVED4[1];

	__IO uint32_t SYSAHBCLKCTRL; /*!< Offset: 0x080 (R/W)  System AHB clock
																	control Register */
	uint32_t RESERVED5[4];
	__IO uint32_t SSP0CLKDIV;
	__IO uint32_t UARTCLKDIV;
	__IO uint32_t SSP1CLKDIV; /*!< Offset: 0x09C SSP1 clock divider (R/W) */
	uint32_t RESERVED6[3];

	__IO uint32_t TRACECLKDIV;

	__IO uint32_t SYSTICKCLKDIV; /* Offset 0xB0 */
	uint32_t RESERVED7[3];

