portapack-mayhem/mayhem-firmware/firmware/chibios/os/hal/platforms/LPC13xx/LPC13xx.h
	__IO uint32_t USBCLKSEL; /* Offset 0xC0 */
	__IO uint32_t USBCLKUEN;
	__IO uint32_t USBCLKDIV;
	uint32_t RESERVED8[1];
	__IO uint32_t
			WDTCLKSEL; /*!< Offset: 0x0D0 (R/W)  WDT clock source select Register */
	__IO uint32_t WDTCLKUEN; /*!< Offset: 0x0D4 (R/W)  WDT clock source update
															enable Register */
	__IO uint32_t
			WDTCLKDIV; /*!< Offset: 0x0D8 (R/W)  WDT clock divider Register */
	uint32_t RESERVED9[1];

	__IO uint32_t CLKOUTCLKSEL; /*!< Offset: 0x0E0 (R/W)  CLKOUT clock source
																 select Register */
	__IO uint32_t CLKOUTUEN; /*!< Offset: 0x0E4 (R/W)  CLKOUT clock source update
															enable Register */
	__IO uint32_t
			CLKOUTDIV; /*!< Offset: 0x0E8 (R/W)  CLKOUT clock divider Register */
	uint32_t RESERVED10[5];

	__I uint32_t PIOPORCAP0; /*!< Offset: 0x100 (R/ )  POR captured PIO status 0
															Register */
	__I uint32_t PIOPORCAP1; /*!< Offset: 0x104 (R/ )  POR captured PIO status 1
															Register */
	uint32_t RESERVED11[11];
	uint32_t RESERVED12[7];
	__IO uint32_t BODCTRL; /*!< Offset: 0x150 (R/W)  BOD control Register */
	uint32_t RESERVED13[1];
	__IO uint32_t SYSTCKCAL; /*!< Offset: 0x158 (R/W)  System tick counter
															calibration Register */
	uint32_t RESERVED14[41];

	__IO uint32_t STARTAPRP0; /*!< Offset: 0x200 (R/W)  Start logic edge control
															 Register 0 */
	__IO uint32_t STARTERP0;	/*!< Offset: 0x204 (R/W)  Start logic signal enable
															 Register 0 */
	__O uint32_t
			STARTRSRP0CLR; /*!< Offset: 0x208 ( /W)  Start logic reset Register 0 */
	__I uint32_t
			STARTSRP0; /*!< Offset: 0x20C (R/ )  Start logic status Register 0 */
	__IO uint32_t STARTAPRP1; /*!< Offset: 0x210 (R/W)  Start logic edge control
															 Register 1   (LPC11UXX only) */
	__IO uint32_t STARTERP1;	/*!< Offset: 0x214 (R/W)  Start logic signal enable
															 Register 1  (LPC11UXX only) */
	__O uint32_t STARTRSRP1CLR; /*!< Offset: 0x218 ( /W)  Start logic reset
																 Register 1          (LPC11UXX only) */
	__I uint32_t STARTSRP1; /*!< Offset: 0x21C (R/ )  Start logic status Register
														 1         (LPC11UXX only) */
	uint32_t RESERVED17[4];

	__IO uint32_t PDSLEEPCFG; /*!< Offset: 0x230 (R/W)  Power-down states in
															 Deep-sleep mode Register  */
	__IO uint32_t PDAWAKECFG; /*!< Offset: 0x234 (R/W)  Power-down states after
															 wake-up from Deep-sleep mode Register*/
	__IO uint32_t
			PDRUNCFG; /*!< Offset: 0x238 (R/W)  Power-down configuration Register*/
	uint32_t RESERVED18[110];
	__I uint32_t DEVICE_ID; /*!< Offset: 0x3F4 (R/ )  Device ID Register */
} LPC_SYSCON_TypeDef;
/*@}*/ /* end of group LPC13xx_SYSCON */

/*------------- Pin Connect Block (IOCON) --------------------------------*/
/** @addtogroup LPC13xx_IOCON LPC13xx I/O Configuration Block
	@{
*/
typedef struct {
	__IO uint32_t
			PIO2_6; /*!< Offset: 0x000 (R/W) I/O configuration for pin PIO2_6 */
	uint32_t RESERVED0[1];
	__IO uint32_t PIO2_0; /*!< Offset: 0x008 (R/W)  I/O configuration for pin
													 PIO2_0/DTR/SSEL1 */
	__IO uint32_t RESET_PIO0_0; /*!< Offset: 0x00C (R/W)  I/O configuration for
																 pin RESET/PIO0_0  */
	__IO uint32_t PIO0_1; /*!< Offset: 0x010 (R/W)  I/O configuration for pin
													 PIO0_1/CLKOUT/CT32B0_MAT2 */
	__IO uint32_t PIO1_8; /*!< Offset: 0x014 (R/W)  I/O configuration for pin
													 PIO1_8/CT16B1_CAP0 */
	uint32_t RESERVED1[1];
	__IO uint32_t PIO0_2; /*!< Offset: 0x01C (R/W)  I/O configuration for pin
													 PIO0_2/SSEL0/CT16B0_CAP0 */

	__IO uint32_t
			PIO2_7; /*!< Offset: 0x020 (R/W)  I/O configuration for pin PIO2_7 */
	__IO uint32_t
			PIO2_8; /*!< Offset: 0x024 (R/W)  I/O configuration for pin PIO2_8 */
	__IO uint32_t PIO2_1; /*!< Offset: 0x028 (R/W)  I/O configuration for pin
													 PIO2_1/nDSR/SCK1 */
	__IO uint32_t
			PIO0_3; /*!< Offset: 0x02C (R/W)  I/O configuration for pin PIO0_3 */
	__IO uint32_t
			PIO0_4; /*!< Offset: 0x030 (R/W)  I/O configuration for pin PIO0_4/SCL */
	__IO uint32_t
			PIO0_5; /*!< Offset: 0x034 (R/W)  I/O configuration for pin PIO0_5/SDA */
	__IO uint32_t PIO1_9; /*!< Offset: 0x038 (R/W)  I/O configuration for pin
													 PIO1_9/CT16B1_MAT0 */
	__IO uint32_t
			PIO3_4; /*!< Offset: 0x03C (R/W)  I/O configuration for pin PIO3_4 */

	__IO uint32_t
			PIO2_4; /*!< Offset: 0x040 (R/W)  I/O configuration for pin PIO2_4 */
	__IO uint32_t
			PIO2_5; /*!< Offset: 0x044 (R/W)  I/O configuration for pin PIO2_5 */
	__IO uint32_t
			PIO3_5; /*!< Offset: 0x048 (R/W)  I/O configuration for pin PIO3_5 */
	__IO uint32_t
			PIO0_6; /*!< Offset: 0x04C (R/W)  I/O configuration for pin PIO0_6/SCK0 */
	__IO uint32_t
			PIO0_7; /*!< Offset: 0x050 (R/W)  I/O configuration for pin PIO0_7/nCTS */
	__IO uint32_t
			PIO2_9; /*!< Offset: 0x054 (R/W)  I/O configuration for pin PIO2_9 */
	__IO uint32_t
			PIO2_10; /*!< Offset: 0x058 (R/W)  I/O configuration for pin PIO2_10 */
	__IO uint32_t PIO2_2; /*!< Offset: 0x05C (R/W)  I/O configuration for pin
													 PIO2_2/DCD/MISO1 */

	__IO uint32_t PIO0_8; /*!< Offset: 0x060 (R/W)  I/O configuration for pin
													 PIO0_8/MISO0/CT16B0_MAT0 */
	__IO uint32_t PIO0_9; /*!< Offset: 0x064 (R/W)  I/O configuration for pin
													 PIO0_9/MOSI0/CT16B0_MAT1 */
	__IO uint32_t SWCLK_PIO0_10; /*!< Offset: 0x068 (R/W)  I/O configuration for
																	pin SWCLK/PIO0_10/SCK0/CT16B0_MAT2 */
	__IO uint32_t PIO1_10;	 /*!< Offset: 0x06C (R/W)  I/O configuration for pin
															PIO1_10/AD6/CT16B1_MAT1 */
	__IO uint32_t PIO2_11;	 /*!< Offset: 0x070 (R/W)  I/O configuration for pin
															PIO2_11/SCK0 */
	__IO uint32_t R_PIO0_11; /*!< Offset: 0x074 (R/W)  I/O configuration for pin
															TDI/PIO0_11/AD0/CT32B0_MAT3 */
	__IO uint32_t R_PIO1_0;	 /*!< Offset: 0x078 (R/W)  I/O configuration for pin
															TMS/PIO1_0/AD1/CT32B1_CAP0 */
	__IO uint32_t R_PIO1_1;	 /*!< Offset: 0x07C (R/W)  I/O configuration for pin
															TDO/PIO1_1/AD2/CT32B1_MAT0 */

	__IO uint32_t R_PIO1_2; /*!< Offset: 0x080 (R/W)  I/O configuration for pin
														 nTRST/PIO1_2/AD3/CT32B1_MAT1 */
	__IO uint32_t
			PIO3_0; /*!< Offset: 0x084 (R/W)  I/O configuration for pin PIO3_0/nDTR */
	__IO uint32_t
			PIO3_1; /*!< Offset: 0x088 (R/W)  I/O configuration for pin PIO3_1/nDSR */
	__IO uint32_t PIO2_3; /*!< Offset: 0x08C (R/W)  I/O configuration for pin
													 PIO2_3/RI/MOSI1 */
	__IO uint32_t SWDIO_PIO1_3; /*!< Offset: 0x090 (R/W)  I/O configuration for
																 pin SWDIO/PIO1_3/AD4/CT32B1_MAT2 */
	__IO uint32_t PIO1_4;	 /*!< Offset: 0x094 (R/W)  I/O configuration for pin
														PIO1_4/AD5/CT32B1_MAT3 */
	__IO uint32_t PIO1_11; /*!< Offset: 0x098 (R/W)  I/O configuration for pin
														PIO1_11/AD7 */
	__IO uint32_t
			PIO3_2; /*!< Offset: 0x09C (R/W)  I/O configuration for pin PIO3_2/nDCD */

	__IO uint32_t PIO1_5;
	__IO uint32_t PIO1_6;
	__IO uint32_t PIO1_7;
	__IO uint32_t PIO3_3;
	__IO uint32_t
			SCK_LOC; /*!< Offset: 0x0B0 SCK pin location select Register (R/W) */
	__IO uint32_t
			DSR_LOC; /*!< Offset: 0x0B4 DSR pin location select Register (R/W) */
	__IO uint32_t
			DCD_LOC; /*!< Offset: 0x0B8 DCD pin location select Register (R/W) */
	__IO uint32_t RI_LOC; /*!< Offset: 0x0BC RI pin location Register (R/W) */
} LPC_IOCON_TypeDef;
