portapack-mayhem/mayhem-firmware/firmware/chibios/os/hal/platforms/LPC13xx/LPC13xx.h
/*@}*/ /* end of group LPC13xx_IOCON */

/*------------- Power Management Unit (PMU) --------------------------*/
/** @addtogroup LPC13xx_PMU LPC13xx Power Management Unit
	@{
*/
typedef struct {
	__IO uint32_t PCON;		/*!< Offset: 0x000 (R/W)  Power control Register */
	__IO uint32_t GPREG0; /*!< Offset: 0x004 (R/W)  General purpose Register 0 */
	__IO uint32_t GPREG1; /*!< Offset: 0x008 (R/W)  General purpose Register 1 */
	__IO uint32_t GPREG2; /*!< Offset: 0x00C (R/W)  General purpose Register 2 */
	__IO uint32_t GPREG3; /*!< Offset: 0x010 (R/W)  General purpose Register 3 */
	__IO uint32_t GPREG4; /*!< Offset: 0x014 (R/W)  General purpose Register 4 */
} LPC_PMU_TypeDef;
/*@}*/ /* end of group LPC13xx_PMU */

/*------------- General Purpose Input/Output (GPIO) --------------------------*/
/** @addtogroup LPC13xx_GPIO LPC13xx General Purpose Input/Output
	@{
*/
typedef struct {
	union {
		__IO uint32_t MASKED_ACCESS[4096]; /*!< Offset: 0x0000 (R/W) Port data
																					Register for pins PIOn_0 to PIOn_11 */
		struct {
			uint32_t RESERVED0[4095];
			__IO uint32_t DATA; /*!< Offset: 0x3FFC (R/W) Port data Register */
		};
	};
	uint32_t RESERVED1[4096];
	__IO uint32_t DIR; /*!< Offset: 0x8000 (R/W)  Data direction Register */
	__IO uint32_t IS;	 /*!< Offset: 0x8004 (R/W)  Interrupt sense Register */
	__IO uint32_t IBE; /*!< Offset: 0x8008 (R/W)  Interrupt both edges Register */
	__IO uint32_t IEV; /*!< Offset: 0x800C (R/W)  Interrupt event Register */
	__IO uint32_t IE;	 /*!< Offset: 0x8010 (R/W)  Interrupt mask Register */
	__I uint32_t RIS;	 /*!< Offset: 0x8014 (R/ )  Raw interrupt status Register */
	__I uint32_t
			MIS; /*!< Offset: 0x8018 (R/ )  Masked interrupt status Register */
	__O uint32_t IC; /*!< Offset: 0x801C ( /W)  Interrupt clear Register */
} LPC_GPIO_TypeDef;
/*@}*/ /* end of group LPC13xx_GPIO */

/*------------- Timer (TMR) --------------------------------------------------*/
/** @addtogroup LPC13xx_TMR LPC13xx 16/32-bit Counter/Timer
	@{
*/
typedef struct {
	__IO uint32_t IR;	 /*!< Offset: 0x000 (R/W)  Interrupt Register */
	__IO uint32_t TCR; /*!< Offset: 0x004 (R/W)  Timer Control Register */
	__IO uint32_t TC;	 /*!< Offset: 0x008 (R/W)  Timer Counter Register */
	__IO uint32_t PR;	 /*!< Offset: 0x00C (R/W)  Prescale Register */
	__IO uint32_t PC;	 /*!< Offset: 0x010 (R/W)  Prescale Counter Register */
	__IO uint32_t MCR; /*!< Offset: 0x014 (R/W)  Match Control Register */
	__IO uint32_t MR0; /*!< Offset: 0x018 (R/W)  Match Register 0 */
	__IO uint32_t MR1; /*!< Offset: 0x01C (R/W)  Match Register 1 */
	__IO uint32_t MR2; /*!< Offset: 0x020 (R/W)  Match Register 2 */
	__IO uint32_t MR3; /*!< Offset: 0x024 (R/W)  Match Register 3 */
	__IO uint32_t CCR; /*!< Offset: 0x028 (R/W)  Capture Control Register */
	__I uint32_t CR0;	 /*!< Offset: 0x02C (R/ )  Capture Register 0 */
	uint32_t RESERVED1[3];
	__IO uint32_t EMR; /*!< Offset: 0x03C (R/W)  External Match Register */
	uint32_t RESERVED2[12];
	__IO uint32_t CTCR; /*!< Offset: 0x070 (R/W)  Count Control Register */
	__IO uint32_t PWMC; /*!< Offset: 0x074 (R/W)  PWM Control Register */
} LPC_TMR_TypeDef;
/*@}*/ /* end of group LPC13xx_TMR */

/*------------- Universal Asynchronous Receiver Transmitter (UART) -----------*/
/** @addtogroup LPC13xx_UART LPC13xx Universal Asynchronous Receiver/Transmitter
	@{
*/
typedef struct {
	union {
		__I uint32_t RBR;	 /*!< Offset: 0x000 (R/ )  Receiver Buffer  Register */
		__O uint32_t THR;	 /*!< Offset: 0x000 ( /W)  Transmit Holding Register */
		__IO uint32_t DLL; /*!< Offset: 0x000 (R/W)  Divisor Latch LSB */
	};
	union {
		__IO uint32_t DLM; /*!< Offset: 0x004 (R/W)  Divisor Latch MSB */
		__IO uint32_t IER; /*!< Offset: 0x000 (R/W)  Interrupt Enable Register */
	};
	union {
		__I uint32_t IIR; /*!< Offset: 0x008 (R/ )  Interrupt ID Register */
		__O uint32_t FCR; /*!< Offset: 0x008 ( /W)  FIFO Control Register */
	};
	__IO uint32_t LCR; /*!< Offset: 0x00C (R/W)  Line Control Register */
	__IO uint32_t MCR; /*!< Offset: 0x010 (R/W)  Modem control Register */
	__I uint32_t LSR;	 /*!< Offset: 0x014 (R/ )  Line Status Register */
	__I uint32_t MSR;	 /*!< Offset: 0x018 (R/ )  Modem status Register */
	__IO uint32_t SCR; /*!< Offset: 0x01C (R/W)  Scratch Pad Register */
	__IO uint32_t ACR; /*!< Offset: 0x020 (R/W)  Auto-baud Control Register */
	uint32_t RESERVED0[1];
	__IO uint32_t FDR; /*!< Offset: 0x028 (R/W)  Fractional Divider Register */
	uint32_t RESERVED1[1];
	__IO uint32_t TER; /*!< Offset: 0x030 (R/W)  Transmit Enable Register */
	uint32_t RESERVED2[6];
	__IO uint32_t
			RS485CTRL; /*!< Offset: 0x04C (R/W)  RS-485/EIA-485 Control Register */
	__IO uint32_t ADRMATCH; /*!< Offset: 0x050 (R/W)  RS-485/EIA-485 address match
														 Register */
	__IO uint32_t RS485DLY; /*!< Offset: 0x054 (R/W)  RS-485/EIA-485 direction
														 control delay Register */

} LPC_UART_TypeDef;
/*@}*/ /* end of group LPC13xx_UART */

/*------------- Synchronous Serial Communication (SSP) -----------------------*/
/** @addtogroup LPC13xx_SSP LPC13xx Synchronous Serial Port
	@{
*/
typedef struct {
	__IO uint32_t CR0;	/*!< Offset: 0x000 (R/W)  Control Register 0 */
	__IO uint32_t CR1;	/*!< Offset: 0x004 (R/W)  Control Register 1 */
	__IO uint32_t DR;		/*!< Offset: 0x008 (R/W)  Data Register */
	__I uint32_t SR;		/*!< Offset: 0x00C (R/ )  Status Register */
	__IO uint32_t CPSR; /*!< Offset: 0x010 (R/W)  Clock Prescale Register */
	__IO uint32_t
			IMSC; /*!< Offset: 0x014 (R/W)  Interrupt Mask Set and Clear Register */
	__I uint32_t RIS; /*!< Offset: 0x018 (R/ )  Raw Interrupt Status Register */
	__I uint32_t
			MIS; /*!< Offset: 0x01C (R/ )  Masked Interrupt Status Register */
	__O uint32_t ICR; /*!< Offset: 0x020 ( /W)  SSPICR Interrupt Clear Register */
} LPC_SSP_TypeDef;
/*@}*/ /* end of group LPC13xx_SSP */

/*------------- Inter-Integrated Circuit (I2C) -------------------------------*/
/** @addtogroup LPC13xx_I2C LPC13xx I2C-Bus Interface
	@{
*/
typedef struct {
	__IO uint32_t CONSET; /*!< Offset: 0x000 (R/W)  I2C Control Set Register */
	__I uint32_t STAT;		/*!< Offset: 0x004 (R/ )  I2C Status Register */
	__IO uint32_t DAT;		/*!< Offset: 0x008 (R/W)  I2C Data Register */
	__IO uint32_t ADR0; /*!< Offset: 0x00C (R/W)  I2C Slave Address Register 0 */
	__IO uint32_t
			SCLH; /*!< Offset: 0x010 (R/W)  SCH Duty Cycle Register High Half Word */
	__IO uint32_t
			SCLL; /*!< Offset: 0x014 (R/W)  SCL Duty Cycle Register Low Half Word */
	__O uint32_t CONCLR; /*!< Offset: 0x018 ( /W)  I2C Control Clear Register */
	__IO uint32_t
			MMCTRL;					/*!< Offset: 0x01C (R/W)  Monitor mode control register */
	__IO uint32_t ADR1; /*!< Offset: 0x020 (R/W)  I2C Slave Address Register 1 */
	__IO uint32_t ADR2; /*!< Offset: 0x024 (R/W)  I2C Slave Address Register 2 */
	__IO uint32_t ADR3; /*!< Offset: 0x028 (R/W)  I2C Slave Address Register 3 */
	__I uint32_t DATA_BUFFER; /*!< Offset: 0x02C (R/ )  Data buffer Register */
	__IO uint32_t
			MASK0; /*!< Offset: 0x030 (R/W)  I2C Slave address mask register 0 */
	__IO uint32_t
			MASK1; /*!< Offset: 0x034 (R/W)  I2C Slave address mask register 1 */
	__IO uint32_t
			MASK2; /*!< Offset: 0x038 (R/W)  I2C Slave address mask register 2 */
	__IO uint32_t
			MASK3; /*!< Offset: 0x03C (R/W)  I2C Slave address mask register 3 */
} LPC_I2C_TypeDef;
/*@}*/ /* end of group LPC13xx_I2C */

/*------------- Windowed Watchdog Timer (WWDT)
 * -----------------------------------------*/
/** @addtogroup LPC13xx_WWDT LPC13xx Windowed WatchDog Timer
	@{
*/
typedef struct {
	__IO uint32_t MOD;
	__IO uint32_t TC;
	__O uint32_t FEED;
	__I uint32_t TV;
	uint32_t RESERVED0;
	__IO uint32_t
			WARNINT; /*!< Offset: 0x014 Watchdog timer warning int. register (R/W) */
	__IO uint32_t
			WINDOW; /*!< Offset: 0x018 Watchdog timer window value register (R/W) */
} LPC_WWDT_TypeDef;
/*@}*/ /* end of group LPC13xx_WWDT */

/*------------- Analog-to-Digital Converter (ADC) ----------------------------*/
/** @addtogroup LPC13xx_ADC LPC13xx Analog-to-Digital Converter
	@{
*/
typedef struct {
	__IO uint32_t CR;	 /*!< Offset: 0x000 (R/W)  A/D Control Register */
	__IO uint32_t GDR; /*!< Offset: 0x004 (R/W)  A/D Global Data Register */
	uint32_t RESERVED0[1];
	__IO uint32_t
			INTEN; /*!< Offset: 0x00C (R/W)  A/D Interrupt Enable Register */
	__IO uint32_t
			DR[8];				 /*!< Offset: 0x010 (R/W)  A/D Channel 0..7 Data Register */
	__I uint32_t STAT; /*!< Offset: 0x030 (R/ )  A/D Status Register */
} LPC_ADC_TypeDef;
/*@}*/ /* end of group LPC13xx_ADC */

/*------------- Universal Serial Bus (USB) -----------------------------------*/
/** @addtogroup LPC13xx_USB LPC13xx Universal Serial Bus
	@{
*/
typedef struct {
	__I uint32_t DevIntSt;	/*!< Offset: 0x000 (R/ )  USB Device Interrupt Status
														 Register */
	__IO uint32_t DevIntEn; /*!< Offset: 0x004 (R/W)  USB Device Interrupt Enable
														 Register */
	__O uint32_t DevIntClr; /*!< Offset: 0x008 ( /W)  USB Device Interrupt Clear
														 Register */
	__O uint32_t
			DevIntSet; /*!< Offset: 0x00C ( /W)  USB Device Interrupt Set Register */

	__O uint32_t CmdCode; /*!< Offset: 0x010 ( /W)  USB Command Code Register */
	__I uint32_t CmdData; /*!< Offset: 0x014 (R/ )  USB Command Data Register */

