portapack-mayhem/mayhem-firmware/firmware/chibios/os/hal/platforms/LPC13xx/LPC13xx.h
	__I uint32_t RxData; /*!< Offset: 0x018 (R/ )  USB Receive Data Register */
	__O uint32_t TxData; /*!< Offset: 0x01C ( /W)  USB Transmit Data Register */
	__I uint32_t
			RxPLen; /*!< Offset: 0x020 (R/ )  USB Receive Packet Length Register */
	__O uint32_t
			TxPLen; /*!< Offset: 0x024 ( /W)  USB Transmit Packet Length Register */
	__IO uint32_t Ctrl; /*!< Offset: 0x028 (R/ )  USB Control Register */
	__O uint32_t
			DevFIQSel; /*!< Offset: 0x02C ( /W)  USB Device FIQ select Register */
} LPC_USB_TypeDef;
/*@}*/ /* end of group LPC13xx_USB */

#if defined(__CC_ARM)
#pragma no_anon_unions
#endif

/******************************************************************************/
/*                         Peripheral memory map                              */
/******************************************************************************/
/* Base addresses                                                             */
#define LPC_FLASH_BASE (0x00000000UL)
#define LPC_RAM_BASE (0x10000000UL)
#define LPC_APB0_BASE (0x40000000UL)
#define LPC_AHB_BASE (0x50000000UL)

/* APB0 peripherals                                                           */
#define LPC_I2C_BASE (LPC_APB0_BASE + 0x00000)
#define LPC_WWDT_BASE (LPC_APB0_BASE + 0x04000)
#define LPC_UART_BASE (LPC_APB0_BASE + 0x08000)
#define LPC_CT16B0_BASE (LPC_APB0_BASE + 0x0C000)
#define LPC_CT16B1_BASE (LPC_APB0_BASE + 0x10000)
#define LPC_CT32B0_BASE (LPC_APB0_BASE + 0x14000)
#define LPC_CT32B1_BASE (LPC_APB0_BASE + 0x18000)
#define LPC_ADC_BASE (LPC_APB0_BASE + 0x1C000)
#define LPC_USB_BASE (LPC_APB0_BASE + 0x20000)
#define LPC_PMU_BASE (LPC_APB0_BASE + 0x38000)
#define LPC_SSP0_BASE (LPC_APB0_BASE + 0x40000)
#define LPC_IOCON_BASE (LPC_APB0_BASE + 0x44000)
#define LPC_SYSCON_BASE (LPC_APB0_BASE + 0x48000)
#define LPC_SSP1_BASE (LPC_APB0_BASE + 0x58000)

/* AHB peripherals                                                            */
#define LPC_GPIO_BASE (LPC_AHB_BASE + 0x00000)
#define LPC_GPIO0_BASE (LPC_AHB_BASE + 0x00000)
#define LPC_GPIO1_BASE (LPC_AHB_BASE + 0x10000)
#define LPC_GPIO2_BASE (LPC_AHB_BASE + 0x20000)
#define LPC_GPIO3_BASE (LPC_AHB_BASE + 0x30000)

/******************************************************************************/
/*                         Peripheral declaration                             */
/******************************************************************************/
#define LPC_I2C ((LPC_I2C_TypeDef*)LPC_I2C_BASE)
#define LPC_WWDT ((LPC_WWDT_TypeDef*)LPC_WWDT_BASE)
#define LPC_UART ((LPC_UART_TypeDef*)LPC_UART_BASE)
#define LPC_TMR16B0 ((LPC_TMR_TypeDef*)LPC_CT16B0_BASE)
#define LPC_TMR16B1 ((LPC_TMR_TypeDef*)LPC_CT16B1_BASE)
#define LPC_TMR32B0 ((LPC_TMR_TypeDef*)LPC_CT32B0_BASE)
#define LPC_TMR32B1 ((LPC_TMR_TypeDef*)LPC_CT32B1_BASE)
#define LPC_ADC ((LPC_ADC_TypeDef*)LPC_ADC_BASE)
#define LPC_PMU ((LPC_PMU_TypeDef*)LPC_PMU_BASE)
#define LPC_SSP0 ((LPC_SSP_TypeDef*)LPC_SSP0_BASE)
#define LPC_SSP1 ((LPC_SSP_TypeDef*)LPC_SSP1_BASE)
#define LPC_IOCON ((LPC_IOCON_TypeDef*)LPC_IOCON_BASE)
#define LPC_SYSCON ((LPC_SYSCON_TypeDef*)LPC_SYSCON_BASE)
#define LPC_USB ((LPC_USB_TypeDef*)LPC_USB_BASE)
#define LPC_GPIO0 ((LPC_GPIO_TypeDef*)LPC_GPIO0_BASE)
#define LPC_GPIO1 ((LPC_GPIO_TypeDef*)LPC_GPIO1_BASE)
#define LPC_GPIO2 ((LPC_GPIO_TypeDef*)LPC_GPIO2_BASE)
#define LPC_GPIO3 ((LPC_GPIO_TypeDef*)LPC_GPIO3_BASE)

#ifdef __cplusplus
}
#endif

#endif /* __LPC13xx_H__ */
